; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v2 ?v9)
             (pred_9 ?v5 ?v1)
             (pred_11 ?v2 ?v1)
             (pred_5 ?v3 ?v2 )
	     (pred_8 ?v2)
             (pred_7 ?v12)
             (pred_1 ?v5)
             (pred_4 ?v1)
             (pred_10 ?v2)
             (pred_3 ?v5)
             (pred_2 ?v2)
             (pred_6 ))



(:action op_2
:parameters (?v6 ?v13 ?v11 ?v10)
:precondition (and (pred_7 ?v6) (pred_7 ?v13) (pred_1 ?v11) (pred_4 ?v10)
          (pred_12 ?v6 ?v13) (pred_9 ?v11 ?v10)
                   (pred_11 ?v13 ?v10) (pred_8 ?v6) 
                   (pred_10 ?v13) (pred_3 ?v11))
:effect (and  (pred_2 ?v13) (not (pred_10 ?v13))))


(:action op_4
:parameters (?v6 ?v4)
:precondition (and (pred_7 ?v6) (pred_7 ?v4)
               (pred_8 ?v6) (pred_12 ?v6 ?v4) (pred_2 ?v4))
:effect (and (pred_8 ?v4) (not (pred_8 ?v6))))

(:action op_5
:parameters (?v6 ?v11)
:precondition (and (pred_7 ?v6) (pred_1 ?v11) 
                  (pred_8 ?v6) (pred_5 ?v11 ?v6) (pred_6 ))
:effect (and (pred_3 ?v11)
   (not (pred_5 ?v11 ?v6)) (not (pred_6 ))))


(:action op_3
:parameters (?v6 ?v7 ?v8)
:precondition (and (pred_7 ?v6) (pred_1 ?v7) (pred_1 ?v8)
                  (pred_8 ?v6) (pred_3 ?v8) (pred_5 ?v7 ?v6))
:effect (and (pred_3 ?v7) (pred_5 ?v8 ?v6)
        (not (pred_3 ?v8)) (not (pred_5 ?v7 ?v6))))

(:action op_1
:parameters (?v6 ?v11)
:precondition (and (pred_7 ?v6) (pred_1 ?v11) 
                  (pred_8 ?v6) (pred_3 ?v11))
:effect (and (pred_6 ) (pred_5 ?v11 ?v6) (not (pred_3 ?v11)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_14 obj_17 obj_09 obj_08 obj_12 obj_19 obj_30 obj_18 obj_29 obj_03 obj_05 obj_21 obj_27 obj_11 obj_13 obj_24 obj_22 obj_02 obj_01 obj_25 obj_15 obj_10 obj_16 obj_28 obj_04
    obj_23 obj_07
    obj_20 obj_26 obj_06
    )

    (:init
       (pred_6)

       (pred_7 obj_14)
       (pred_7 obj_17)
       (pred_7 obj_09)
       (pred_7 obj_08)
       (pred_7 obj_12)
       (pred_7 obj_19)
       (pred_7 obj_30)
       (pred_7 obj_18)
       (pred_7 obj_29)
       (pred_7 obj_03)
       (pred_7 obj_05)
       (pred_7 obj_21)
       (pred_7 obj_27)
       (pred_7 obj_11)
       (pred_7 obj_13)
       (pred_7 obj_24)
       (pred_7 obj_22)
       (pred_7 obj_02)
       (pred_7 obj_01)
       (pred_7 obj_25)
       (pred_7 obj_15)
       (pred_7 obj_10)
       (pred_7 obj_16)
       (pred_7 obj_28)
       (pred_7 obj_04)
       (pred_4 obj_23)
       (pred_4 obj_07)
       (pred_1 obj_20)
       (pred_1 obj_26)
       (pred_1 obj_06)

       (pred_12 obj_14 obj_19)
       (pred_12 obj_14 obj_17)
       (pred_12 obj_17 obj_30)
       (pred_12 obj_17 obj_09)
       (pred_12 obj_17 obj_14)
       (pred_12 obj_09 obj_18)
       (pred_12 obj_09 obj_08)
       (pred_12 obj_09 obj_17)
       (pred_12 obj_08 obj_29)
       (pred_12 obj_08 obj_12)
       (pred_12 obj_08 obj_09)
       (pred_12 obj_12 obj_03)
       (pred_12 obj_12 obj_08)
       (pred_12 obj_19 obj_05)
       (pred_12 obj_19 obj_30)
       (pred_12 obj_19 obj_14)
       (pred_12 obj_30 obj_21)
       (pred_12 obj_30 obj_18)
       (pred_12 obj_30 obj_17)
       (pred_12 obj_30 obj_19)
       (pred_12 obj_18 obj_27)
       (pred_12 obj_18 obj_29)
       (pred_12 obj_18 obj_09)
       (pred_12 obj_18 obj_30)
       (pred_12 obj_29 obj_11)
       (pred_12 obj_29 obj_03)
       (pred_12 obj_29 obj_08)
       (pred_12 obj_29 obj_18)
       (pred_12 obj_03 obj_13)
       (pred_12 obj_03 obj_12)
       (pred_12 obj_03 obj_29)
       (pred_12 obj_05 obj_24)
       (pred_12 obj_05 obj_21)
       (pred_12 obj_05 obj_19)
       (pred_12 obj_21 obj_22)
       (pred_12 obj_21 obj_27)
       (pred_12 obj_21 obj_30)
       (pred_12 obj_21 obj_05)
       (pred_12 obj_27 obj_02)
       (pred_12 obj_27 obj_11)
       (pred_12 obj_27 obj_18)
       (pred_12 obj_27 obj_21)
       (pred_12 obj_11 obj_01)
       (pred_12 obj_11 obj_13)
       (pred_12 obj_11 obj_29)
       (pred_12 obj_11 obj_27)
       (pred_12 obj_13 obj_25)
       (pred_12 obj_13 obj_03)
       (pred_12 obj_13 obj_11)
       (pred_12 obj_24 obj_15)
       (pred_12 obj_24 obj_22)
       (pred_12 obj_24 obj_05)
       (pred_12 obj_22 obj_10)
       (pred_12 obj_22 obj_02)
       (pred_12 obj_22 obj_21)
       (pred_12 obj_22 obj_24)
       (pred_12 obj_02 obj_16)
       (pred_12 obj_02 obj_01)
       (pred_12 obj_02 obj_27)
       (pred_12 obj_02 obj_22)
       (pred_12 obj_01 obj_28)
       (pred_12 obj_01 obj_25)
       (pred_12 obj_01 obj_11)
       (pred_12 obj_01 obj_02)
       (pred_12 obj_25 obj_04)
       (pred_12 obj_25 obj_13)
       (pred_12 obj_25 obj_01)
       (pred_12 obj_15 obj_10)
       (pred_12 obj_15 obj_24)
       (pred_12 obj_10 obj_16)
       (pred_12 obj_10 obj_22)
       (pred_12 obj_10 obj_15)
       (pred_12 obj_16 obj_28)
       (pred_12 obj_16 obj_02)
       (pred_12 obj_16 obj_10)
       (pred_12 obj_28 obj_04)
       (pred_12 obj_28 obj_01)
       (pred_12 obj_28 obj_16)
       (pred_12 obj_04 obj_25)
       (pred_12 obj_04 obj_28)
       (pred_10 obj_16)
       (pred_10 obj_24)
       (pred_10 obj_21)
       (pred_11  obj_16 obj_23)
       (pred_11  obj_24 obj_07)
       (pred_11  obj_21 obj_23)
       (pred_2 obj_14)
       (pred_2 obj_17)
       (pred_2 obj_09)
       (pred_2 obj_08)
       (pred_2 obj_12)
       (pred_2 obj_19)
       (pred_2 obj_30)
       (pred_2 obj_18)
       (pred_2 obj_29)
       (pred_2 obj_03)
       (pred_2 obj_05)
       (pred_2 obj_27)
       (pred_2 obj_11)
       (pred_2 obj_13)
       (pred_2 obj_22)
       (pred_2 obj_02)
       (pred_2 obj_01)
       (pred_2 obj_25)
       (pred_2 obj_15)
       (pred_2 obj_10)
       (pred_2 obj_28)
       (pred_2 obj_04)

       (pred_9  obj_20 obj_23)
       (pred_9  obj_26 obj_07)
       (pred_9  obj_06 obj_07)
       (pred_5 obj_20 obj_25)
       (pred_5 obj_26 obj_14)
       (pred_5 obj_06 obj_11)
       (pred_8 obj_25)
    )

    (:goal (and
       (pred_5 obj_20 obj_11)
    ))
(:constraints
  (always (not (pred_8 obj_13)))
)
)

; plan
1. (op_5 obj_25 obj_20)
   deleted: (pred_5 obj_20 obj_25) (pred_6)
   added: (pred_3 obj_20)
   goals met: 0 of 1
2. (op_4 obj_25 obj_01)
   deleted: (pred_8 obj_25)
   added: (pred_8 obj_01)
   goals met: 0 of 1
3. (op_4 obj_01 obj_11)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_11)
   goals met: 0 of 1
4. (op_3 obj_11 obj_06 obj_20)
   deleted: (pred_3 obj_20) (pred_5 obj_06 obj_11)
   added: (pred_3 obj_06) (pred_5 obj_20 obj_11)
   goals met: 1 of 1
